#!/bin/bash

# Shell 条件测试
# 格式1: test 条件表达式
# 格式2: [ 条件表达式 ]
# 格式3: [[ 条件表达式 ]]

# 1.⽂文件测试
# [ -e dir|file ]
# [ -d dir ] 是否存在,⽽而且是⽬目录
# [ -f file ] 是否存在，⽽而且是⽂文件
# [ -r file ] 读权限
# [ -x file ] 执⾏行行权限
# [ -w file ] 写权限

# 常⻅使⽤⽅式
# [	!	-d	/test	]	&&	mkdir	/test
# [	-d	/test	]	||	mkdir	/test


# 2.数值⽐比较
# 数值⽐比较 [ 整数 1 操作符 整数 2 ]
# [ 1 -gt 10 ] ⼤于
# [ 1 -lt 10 ] ⼩于
# [ 1 -eq 10 ] 等于
# [ 1 -ne 10 ] 不等于
# [ 1 -ge 10 ] 大于等于
# [ 1 -le 10 ] 小于等于

[ 3 -eq 3 ]; echo $?         # 0
[ "3" -eq 3 ]; echo $?       # 0
[ "3" -eq "3" ]; echo $?     # 0
[ "3" -eq "2" ]; echo $?     # 1
[ "3" -gt "2" ]; echo $?     # 0
[ "3" -gt "3" ]; echo $?     # 1
[ "3" -ge "3" ]; echo $?     # 0

echo "----------------------"

# 3.字符串串⽐比较
# == 是否相等, != 是否不相等, -z 字符⻓度为0, -n 字符⻓度不为0
str="abc"
str2=""
[ $str == abc ]; echo $?          # 0
[ "$str" == abc ]; echo $?        # 0
[ "$str" == "abc" ]; echo $?      # 0
[ "$str" == "ab" ]; echo $?       # 1
[ "$str" != "ab" ]; echo $?       # 0
[ -z "$str" ]; echo $?            # 1
[ -n "$str" ]; echo $?            # 0
[ -z "$str2" ]; echo $?           # 0
[ -n "$str2" ]; echo $?           # 1
[ -z "$str3" ]; echo $?           # 0
[ -n "$str3" ]; echo $?           # 1

echo "----------------------"

# 正则⽐对
[[ "123" =~ ^[0-9]+$ ]];echo $?    # 0
[[ "123a" =~ ^[0-9]+$ ]];echo $?   # 1





